export default function ConductDetails(props: any) {
  return (
    <>
      <h3 className="text-2xl my-10">مدة وصلاحية هذا الميثاق: </h3>
      <p> سنة دراسية واحدة تبدأ من تاريخ الإقرار على الميثاق.</p>
      <div className="border rounded border-gray-300 p-6 mb-5  h-[400px] overflow-x-hidden overflow-y-scroll">
        <div className="parents p-6">
          <section>
            <h2 className="text-2xl font-semibold  text-black mt-4 mb-4">
              التزامات المدرسة
            </h2>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                ضمان بيئة مدرسية قائمة على المساواة وتكافؤ الفرص بين الطلبة
                كافة.
              </li>
              <li>
                اطلاع أولياء الأمور على نتائج التقييمات والإجراءات المعتمدة لرفع
                مستوى أداء أبنائهم.
              </li>
              <li>
                إبلاغ أولياء الأمور عن سلوكيات أبنائهم الإيجابية، بالإضافة إلى
                مخالفاتهم السلوكية.
              </li>
              <li>
                تعريف أولياء أمور الطلبة من فئة أصحاب الهمم بحقوقهم وواجباتهم
                وتوفير بيئة تعليمية غنية وداعمة ومرافق مجهزة ومعدلة تلائم
                احتياجاتهم.
              </li>
              <li>ضمان توفير بيئة مدرسية آمنة وشاملة تضمن سلامة الطلبة.</li>
              <li>
                وضع الإرشادات الخاصة بصحة الطلبة وتوعيتهم بأهمية تبني عادات
                وأنماط الحياة الصحية.
              </li>
              <li>
                بناء قنوات تواصل فعالة مع أولياء الأمور لإبلاغهم بالمستجدات من
                التعليمات أو الإجراءات أو اللوائح ومشاركتهم بالمعلومات المهمة
                بالإضافة إلى اطلاعهم على أخبار المدرسة.
              </li>
              <li>
                الشفافية والعدالة في تنفيذ الإجراءات والسياسات مع الحفاظ على
                سرية المعلومات وبيانات الطلبة.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              السلوك والانضباط
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تطبيق القرار الوزاري رقم (851) لسنة 2018 بشأن لائحة إدارة سلوك
                الطلبة في مؤسسات التعليم العام الطلبة بعدالة وشفافية، مع توعية
                الطلبة وأولياء أمورهم بالعواقب المترتبة على المخالفات.
              </li>
              <li>
                متابعة انتظام الطلبة في الحضور والانصراف وفق المواعيد الرسمية
                والأدلة الإجرائية، واتخاذ الإجراءات المناسبة عند وجود تأخير أو
                غياب غير مبرر.
              </li>
              <li>
                الالتزام باحترام أولياء الأمور، وبناء قنوات تواصل فعّالة معهم
                لإبلاغهم بالمستجدات المتعلقة بالتعليمات والإجراءات واللوائح،
                ومشاركتهم بالمعلومات المهمة، وإطلاعهم على أخبار المدرسة بانتظام.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              جودة حياة الطلبة / الصحة والسلامة
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                توفير بيئة مدرسية صحية وآمنة تتوافق مع معايير الامن والسلامة.
              </li>
              <li>
                تنظيم برامج توعية لتعزيز النظافة الشخصية والصحة العامة للطلبة.
              </li>
              <li>
                حفظ السجلات الطبية الخاصة بالطلبة والتنسيق مع أولياء الأمور بشأن
                أي حالات صحية.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              المواطنة الإيجابية والهوية الوطنية
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تنظيم فعاليات لتعزيز قيم المواطنة الصالحة والمسؤولية الاجتماعية
                لدى الطلبة.
              </li>
              <li>
                غرس الاعتزاز بالهوية الوطنية والقيم الإنسانية مثل الاحترام
                والتسامح والتعايش المشترك من خلال الأنشطة المختلفة.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              التحصيل الدراسي والمناهج والبرامج التعليمية
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>تحديث بيانات الطلبة بشكل دوري في أنظمة الوزارة.</li>
              <li>
                متابعة الأداء الأكاديمي للطلبة بانتظام، وإشراك أولياء الأمور في
                نتائج التقييمات والإجراءات المعتمدة لرفع مستوى أبنائهم.
              </li>
              <li>
                إعداد وتنفيذ خطط تربوية فردية للطلبة من أصحاب الهمم بالتعاون مع
                أسرهم.
              </li>
              <li>
                الشفافية والعدالة في تنفيذ الإجراءات والسياسات مع الحفاظ على
                سرية المعلومات وبيانات الطلبة.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              التقييم والامتحانات
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تطبيق سياسة التقييم المعتمدة والالتزام بالمواعيد الرسمية
                للتقييمات والامتحانات.
              </li>
              <li>متابعة نتائج الطلبة بشكل مستمر وتقديم التغذية الراجعة.</li>
              <li>
                ضمان جاهزية بيئة الامتحانات وتوفير الأدوات والأجهزة اللازمة.
              </li>
              <li>
                منع أي ممارسات تتعلق بالغش أو تسريب الأسئلة، واتخاذ الإجراءات
                الرادعة عند وقوعها.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              الأنشطة والرعاية الطلابية
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                توفير أنشطة صفية ولاصفية متنوعة لاكتشاف وتنمية مهارات الطلبة.
              </li>
              <li>
                تشجيع الطلبة على المشاركة في المبادرات الوطنية والبرامج التطوعية
                وخدمة المجتمع.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              المواصلات
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                الإشراف على خدمات النقل المدرسي الخاصة بالمدرسة وضمان الالتزام
                بمعايير السلامة.
              </li>
              <li>
                متابعة سلوك الطلبة في الحافلات واتخاذ الإجراءات التربوية عند
                حدوث مخالفات.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              الزي المدرسي
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                توعية أولياء الأمور بدليل الزي المدرسي وقنوات البيع الرسمية للزي
                المدرسي الموحد.
              </li>
              <li>
                متابعة التزام الطلبة بالزي والمظهر اللائق أثناء الدوام المدرسي.
              </li>
            </ul>
          </section>

          <section>
            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              الممتلكات العامة بالمدرسة
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تعزيز وعي الطلبة بأهمية المحافظة على الممتلكات العامة والمرافق
                المدرسية.
              </li>
              <li>
                مراقبة استخدام الطلبة للمرافق وضمان حمايتها من العبث أو التخريب.
              </li>
              <li>
                تطبيق الإجراءات المناسبة في حال حدوث أضرار، بالتنسيق مع أولياء
                الأمور.
              </li>
            </ul>
          </section>

          <section>
            <h2 className="text-2xl font-semibold  text-black mt-4 mb-4">
              التزامات ولي الأمر
            </h2>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              السلوك
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تشجيع أبنائهم على تبني القيم الأخلاقية والتربوية وتعزيز السُّلوك
                الايجابي لديهم وتحفيزهم على التعلم والالتزام بالقوانين واحترام
                جميع العاملين في المدرسة.
              </li>
              <li>
                الاطلاع على لائحة إدارة سلوك الطلبة في مؤسسات التعليم الحكومية
                الاتحادية المعتمدة، وتوعية وارشاد أبنائهم على ضرورة الالتزام بها
                والعواقب التي تترتب على مخالفتها.
              </li>
              <li>
                حث الطلبة على الالتزام بمواعيد الحضور والانصراف والإلمام
                بالنتائج المترتبة على التأخير وعدم الغياب دون عذر مقبول بالحضور
                المبكر للمدرسة وفق المواعيد المحددة والإلمام بعواقب الغياب دون
                عذر مقبول والتي تتضمن رسوب السنة الدراسية وإعادة السنة كاملة.
              </li>
              <li>
                الالتزام بتعليمات المدرسة عند الحضور لطلب خدمة أو لمناقشة مشكلة
                أو تسوية أية نزاعات.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              جودة حياة الطلبة / الصحة والسلامة
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                توفير بيئة صحية تشمل معايير الأغذية الصحية، وأصناف الطعام
                والشراب المسموح بها في المدرسة.
              </li>
              <li>
                توفير الوقت الكافي للنوم والاسترخاء والراحة النفسية لأبنائهم في
                بيئة عائلية مستقرة.
              </li>
              <li>التوعية حول النظافة الشخصية للأبناء.</li>
              <li>التحفيز على ممارسة الأنشطة البدنية من خلال التحرك واللعب.</li>
              <li>
                تقديم المساعدة والدعم للأبناء في حل المشاكل الشخصية والعاطفية
                والدراسية.
              </li>
              <li>
                توفير كافة التقارير الطبية المتعلقة بالطالب وسيرته المرضية
                لإدارة المدرسة.
              </li>
              <li>
                المشاركة الفعالة من خلال الإجابة على الاستبانات المرسلة من قبل
                الوزارة أو المدرسة.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              المواطنة الإيجابية والهوية الوطنية
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                الالتزام بتعزيز المواطنة الصالحة والمسؤولية الاجتماعية لدى
                الأبناء وتحفيزهم على القيام بالواجبات والمسؤوليات الوطنية،
                وتشجيعهم على المشاركة الفعالة في الحياة الاجتماعية والأعمال
                الخيرية والتطوعية.
              </li>
              <li>
                الالتزام بتحفيز الأبناء على الاعتزاز بهويتهم الوطنية، والتحلّي
                بالأخلاق والقيم الإنسانية الأساسية كالاحترام والتسامح والتعايش
                المشترك بين المواطنين والمقيمين.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              التحصيل الدراسي والمناهج والبرامج التعليمية
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تحديث بيانات الأبناء حسب الإجراءات والشروط والأحكام المعتمدة في
                الوزارة.
              </li>
              <li>
                يلتزم ولي الأمر بتوفير جهاز الحاسب الي حسب الاجراءات المواصفات
                المعتمدة في الوزارة مع الالتزام بالمعايير والشروط الخاصة بسياسة
                استخدام الحاسوب.
              </li>
              <li>
                التواصل مع إدارة المدرسة لمتابعة أداء أبنائهم في الدراسة وتقديم
                الدعم لهم.
              </li>
              <li>
                تحفيز الأبناء على الدراسة، وتحديد الأهداف الواضحة لهم، وإرشادهم،
                وإظهار أهمية التعليم في حياتهم المستقبلية.
              </li>
              <li>
                تهيئة الجو الأسري وتخصيص الوقت الكافي للدراسة والتحضير
                والاستعداد للامتحانات مع ضمان الوقت الكافي للراحة.
              </li>
              <li>
                متابعة الطلبة من فئة أصحاب الهمم في أداء واجباتهم حسب الخطة
                التربوية الفردية المعتمدة.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              التقييم والامتحانات
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                الاطلاع على سياسة التقييم المعتمدة والتقيد بما جاء فيها
                والالتزام بالمواعيد المحددة بالتقييم والامتحانات.
              </li>
              <li>
                متابعة التقييمات والامتحانات للأبناء بشكل مستمر لرفع مستوى
                أدائهم على مدار العام الدراسي.
              </li>
              <li>
                التأكد من جاهزية الأبناء لأداء الامتحان (إحضار الأدوات اللازمة،
                شحن جهاز الحاسب الآلي/اللوحي).
              </li>
              <li>
                توعية الطالب بالالتزام بقواعد ولوائح تأدية الامتحان وعدم الغش أو
                تسريب أسئلة الامتحانات أو المشاركة فيها بأي شكل من الأشكال.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              الأنشطة والرعاية الطلابية
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تشجيع الأبناء على المشاركة في الأنشطة الصفية واللّاصفية،
                والفعّاليات، والمبادرات الوطنيّة والعمل التطوعي والخدمة
                المجتمعية؛ لاكتساب وصقل المهارات العامة.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              المواصلات
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                الالتزام باتباع جميع شروط السلامة والقواعد السلوكية ومواعيد
                النقل المدرسي التي اعتمدتها المدرسة.
              </li>
              <li>
                توجيه الأبناء إلى الالتزام بالسلوك الإيجابي في الحافلات
                المدرسية.
              </li>
              <li>
                الالتزام بتسديد قيمة أي تلفيات تسبب بها أبناؤه في الحافلة
                المدرسية.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              الزي المدرسي
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                الالتزام بارتداء الأبناء الزّيَّ المدرسي الموحد من قبل الوزارة.
              </li>
              <li>
                التزام الأبناء بالمظهر اللائق والأنيق أثناء الدوام المدرسي.
              </li>
            </ul>

            <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
              الممتلكات العامة بالمدرسة
            </h3>
            <ul className="list-disc pr-6 space-y-2">
              <li>
                تعليم الأبناء قيمة المحافظة على الممتلكات العامة وأهميتها،
                وتحفيزهم على المحافظة عليها.
              </li>
              <li>
                توجيه الأبناء بعدم إلحاق أي أضرار متعمدة أو غير متعمدة
                بالممتلكات العامة في المدرسة.
              </li>
              <li>
                التعهد بالتعويض عن الأضرار الناجمة عن العبث بالممتلكات والمرافق
                التي قد يحدثها الطالب في المدرسة أو وسائل النقل.
              </li>
            </ul>

            {props.studentInfo.National_Expat == "Expats" && (
              <>
                <h3 className="text-xl font-semibold  text-black mt-4 mb-4">
                  الرسوم الدراسية: (للطلبة غير المواطنين){" "}
                </h3>
                <ul className="list-disc pr-6 space-y-2">
                  <li>
                    الالتزام بدفع الرسوم الدراسية المترتبة على الأبناء كاملة في
                    بداية العام الدراسي أو من خلال تقسيط المبلغ على ثلاث دفعات
                    يتم تسديدها قبل بداية كل فصل دراسي وفقاً لشروط الاستحقاق
                    المعتمدة لدى الوزارة، وفي حال عدم الالتزام، يحق للوزارة حجب
                    النتائج الفصلية والنهائية وايقاف الخدمات المدرسية للطالب
                    وإلغاء قيد الطالب للسنة الدراسية اللاحقة وفقاً للوائح
                    المعتمدة ، كما يتحمل ولي الأمر كافة التبعات فيما يخص أحقية
                    التعليم للطالب.
                  </li>
                </ul>
              </>
            )}
          </section>
        </div>
      </div>
    </>
  );
}
